'''Дан массив. Найдите два соседних элемента, сумма которых минимальна.'''
a=[1,6,5,9,8,16,32,4,0,7,-8]
#a=[0,7]
#a=[0]
i=0
if len(a)<2:
	print("Неверный ввод")
else:
	b=[0]*len(a)
	for j in range(len(a)-1):
		b[j]=a[j]+a[j+1]
	b.remove(b[-1])
	i=b.index(min(b))
	print(a[i], a[i+1])