'''
Создать список, каждый элемент которого равен квадрату своего номера.
'''
lenth=15
a=[0]*lenth
for i in range(lenth):
    a[i]=i**2
print(a)